nusschAngE/stm32h7xx/Hardware/sdcard/sdcard.c

#include "stm32h7xx.h"
#include "sdcard.h"
#include "delay.h"

#define SDCardIO                SDMMC1
#define SDCardIRQ               SDMMC1_IRQn

#define SDCardIO_GET_FLAG(__FLAG__)         __SDMMC_GET_FLAG(SDCardIO, __FLAG__)
#define SDCardIO_CLEAR_FLAG(__FLAG__)       __SDMMC_CLEAR_FLAG(SDCardIO, __FLAG__)
#define SDCardIO_ENABLE_IT(__INTERRUPT__)   __SDMMC_ENABLE_IT(SDCardIO, __INTERRUPT__)
#define SDCardIO_DISABLE_IT(__INTERRUPT__)  __SDMMC_DISABLE_IT(SDCardIO, __INTERRUPT__)
#define SDCardIO_TRANSFER_ENABLE()          __SDMMC_CMDTRANS_ENABLE(SDCardIO)
#define SDCardIO_TRANSFER_DISABLE()         __SDMMC_CMDTRANS_DISABLE(SDCardIO)

static HAL_SD_CardInfoTypeDef SDCard;

static uint32_t SDCID[4];
static uint32_t SDCSD[4];
static __IO uint32_t SDCardContext = 0;
static __IO uint32_t SDCardStatus = HAL_SD_STATE_RESET;
static __IO uint32_t SDCardErrStatus = HAL_SD_ERROR_NONE;
#if (SDCARD_DMA_MODE)
static __IO uint32_t *pTxBuffPtr;
static __IO uint32_t TxBuffSize;
static __IO uint32_t *pRxBuffPtr;
static __IO uint32_t RxBuffSize;
static __IO bool SDReadCompleted = FALSE;
static __IO bool SDWriteCompleted = FALSE;
static __IO bool SDReadWriteError = FALSE;
#endif

/*  STATIC 
*/
static uint32_t sd_InitProcess(void);
static uint32_t sd_PowerON(void);
static uint32_t sd_PowerOFF(void);
static uint32_t sd_Reset(void);
static uint32_t sd_InitCard(void);
static uint32_t sd_EnableWideBus(void);
static uint32_t sd_DisableWideBus(void);
static uint32_t sd_SendStatus(uint32_t *pCardStatus);
static uint32_t sd_ReadBlocks(uint8_t *pData, uint32_t BlockAdd, uint32_t NumberOfBlocks);
static uint32_t sd_WriteBlocks(uint8_t *pData, uint32_t BlockAdd, uint32_t NumberOfBlocks);
#if (SDCARD_DMA_MODE)
static uint32_t sd_ReadBlocks_DMA(uint8_t *pData, uint32_t BlockAdd, uint32_t NumberOfBlocks);
static uint32_t sd_WriteBlocks_DMA(uint8_t *pData, uint32_t BlockAdd, uint32_t NumberOfBlocks);
#endif
#if 0
static uint32_t sd_Read_IT(void);
static uint32_t sd_Write_IT(void);
#endif
/****************** PUBLIC FUNCTION **********************/
SD_BaseInfo SDBaseInfo;

/*******************/
/* sd card controller clock & gpio initialize */
void HAL_SD_MspInit(SD_HandleTypeDef *hsd)
{    
    (void)hsd;

	GPIO_InitTypeDef GPIO_Init;

    /* Peripheral clock enable */
    __HAL_RCC_SDMMC1_CLK_ENABLE();
    __HAL_RCC_GPIOC_CLK_ENABLE();
    __HAL_RCC_GPIOD_CLK_ENABLE();
  
    /**SDMMC1 GPIO Configuration    
    PC8     ------> SDMMC1_D0
    PC9     ------> SDMMC1_D1
    PC10     ------> SDMMC1_D2
    PC11     ------> SDMMC1_D3
    PC12     ------> SDMMC1_CK
    PD2     ------> SDMMC1_CMD 
    */
    GPIO_Init.Pin = GPIO_PIN_8 |GPIO_PIN_9 |GPIO_PIN_10
    				| GPIO_PIN_11 | GPIO_PIN_12;
    GPIO_Init.Mode = GPIO_MODE_AF_PP;
    GPIO_Init.Pull = GPIO_PULLUP;
    GPIO_Init.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_Init.Alternate = GPIO_AF12_SDIO1;
    HAL_GPIO_Init(GPIOC, &GPIO_Init);

    GPIO_Init.Pin = GPIO_PIN_2;
    GPIO_Init.Mode = GPIO_MODE_AF_PP;
    GPIO_Init.Pull = GPIO_PULLUP;
    GPIO_Init.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_Init.Alternate = GPIO_AF12_SDIO1;
    HAL_GPIO_Init(GPIOD, &GPIO_Init);

#if (SDCARD_DMA_MODE)
    HAL_NVIC_SetPriority(SDCardIRQ, 2, 0);
    HAL_NVIC_EnableIRQ(SDCardIRQ);
#endif
}

#if (SDCARD_DMA_MODE)
void SDMMC1_IRQHandler(void)
{
    uint32_t errorstate = HAL_SD_ERROR_NONE;

    if(SDCardIO_GET_FLAG(SDMMC_FLAG_DATAEND) != RESET)
    {
        /* data transfer end */
        SDCardIO_CLEAR_FLAG(SDMMC_FLAG_DATAEND); 
        /* disable interrupt */
        SDCardIO_DISABLE_IT(SDMMC_IT_DCRCFAIL | SDMMC_IT_DTIMEOUT | SDMMC_IT_RXOVERR\
                           | SDMMC_IT_TXUNDERR | SDMMC_IT_DATAEND | SDMMC_FLAG_IDMATE\
                           | SDMMC_FLAG_TXFIFOHE | SDMMC_FLAG_RXFIFOHF);
        /* DMA Transfer */
        if((SDCardContext & SD_CONTEXT_DMA) != RESET)
        {
            SDCardIO_CLEAR_FLAG(SDMMC_STATIC_FLAGS);
            SDCardIO_TRANSFER_DISABLE();

            SDCardIO->DLEN = 0;
            SDCardIO->DCTRL = 0;
            SDCardIO->IDMACTRL = SDMMC_DISABLE_IDMA ;
        }
        if(SDCardStatus == HAL_SD_STATE_RECEIVING)
        {
            SDReadCompleted = TRUE;
        }
        if(SDCardStatus == HAL_SD_STATE_TRANSFER)
        {
            SDWriteCompleted = TRUE;
        }

        SDCardStatus = HAL_SD_STATE_READY;
    }
#if 0    
    else if (SDCardIO_GET_FLAG(SDMMC_IT_TXFIFOHE) != RESET)
    {
        SDCardIO_CLEAR_FLAG(SDMMC_FLAG_TXFIFOHE);
    
        sd_Write_IT();
    }
    else if (SDCardIO_GET_FLAG(SDMMC_IT_RXFIFOHF) != RESET)
    {
        SDCardIO_CLEAR_FLAG(SDMMC_FLAG_RXFIFOHF);
    
        sd_Read_IT();
    }
#endif    
    else if (SDCardIO_GET_FLAG(SDMMC_IT_DCRCFAIL) != RESET)
    {
        SDCardIO_CLEAR_FLAG(SDMMC_FLAG_DCRCFAIL);
        SDCardIO_DISABLE_IT(SDMMC_IT_DCRCFAIL);
    	SDCardStatus = HAL_SD_STATE_READY;
        SDReadWriteError = TRUE;
    }
    else if (SDCardIO_GET_FLAG(SDMMC_IT_DTIMEOUT) != RESET)
    {
        SDCardIO_CLEAR_FLAG(SDMMC_FLAG_DTIMEOUT);
        SDCardIO_DISABLE_IT(SDMMC_IT_DTIMEOUT);
    	SDCardStatus = HAL_SD_STATE_READY;
        SDReadWriteError = TRUE;
    }
    else if (SDCardIO_GET_FLAG(SDMMC_IT_RXOVERR) != RESET)
    {
        SDCardIO_CLEAR_FLAG(SDMMC_FLAG_RXOVERR);
        SDCardIO_DISABLE_IT(SDMMC_IT_RXOVERR);
    	SDCardStatus = HAL_SD_STATE_READY;
        SDReadWriteError = TRUE;
    }
    else if (SDCardIO_GET_FLAG(SDMMC_IT_TXUNDERR) != RESET)
    {
        SDCardIO_CLEAR_FLAG(SDMMC_FLAG_TXUNDERR);
        SDCardIO_DISABLE_IT(SDMMC_IT_TXUNDERR);
    	SDCardStatus = HAL_SD_STATE_READY;
        SDReadWriteError = TRUE;
    }
    else if(SDCardIO_GET_FLAG(SDMMC_IT_IDMATE) != RESET)
    {
        SDCardIO_TRANSFER_DISABLE();
        SDCardIO_CLEAR_FLAG(SDMMC_FLAG_IDMATE);
        SDCardIO_DISABLE_IT(SDMMC_IT_IDMATE);
       	SDCardStatus = HAL_SD_STATE_READY;
        SDReadWriteError = TRUE;
    }
}
#endif

/*
*   SD Card initialize 
*/
uint8_t SD_Init(void)
{
	uint32_t ret;

	printf("SD_Init start\r\n");

