nusschAngE/stm32h7xx/Hardware/sdcard/sdcard.c
    if(SDCardStatus == HAL_SD_STATE_RESET)
    {
        /* Init the low level hardware : GPIO, CLOCK, CORTEX...etc */
        HAL_SD_MspInit(NULL);
    }

    SDCardStatus = HAL_SD_STATE_BUSY;

    ret = sd_InitProcess();
    if(ret != HAL_SD_ERROR_NONE)
    {
        //printf("sd card init error\r\n");
        return (0);
    }

    ret = sd_EnableWideBus();
    if(ret != HAL_SD_ERROR_NONE)
    {
        printf("sd card config wide bus error\r\n");
        return (0);
    }
    /* data for fatfs */
    SD_GetBaseInfo(&SDBaseInfo);

    SDCardContext = SD_CONTEXT_NONE;
    SDCardStatus = HAL_SD_STATE_READY;
    SDCardErrStatus = HAL_SD_ERROR_NONE;

    printf("SD_Init done\r\n");
    return (1);
}

uint8_t SD_GetCardState(void)
{
    HAL_SD_CardStateTypedef cardstate =  HAL_SD_CARD_TRANSFER;
    uint32_t errorstate = HAL_SD_ERROR_NONE;
    uint32_t resp1 = 0;
  
    errorstate = sd_SendStatus(&resp1);
  
    if (errorstate != HAL_OK)
    {
        SDCardErrStatus = errorstate;
        return (SD_ERROR);
    }
    /* Clear all the static flags */
    SDCardIO_CLEAR_FLAG(SDMMC_STATIC_FLAGS); 
    cardstate = (HAL_SD_CardStateTypedef)((resp1 >> 9) & 0x0F);
    printf("GetCardState = 0x%08x\r\n", cardstate);
    if(cardstate == HAL_SD_CARD_TRANSFER)
    {
        return (SD_READY);
    }
    else if((cardstate == HAL_SD_CARD_ERROR) || (cardstate == HAL_SD_CARD_DISCONNECTED))
    {
        return (SD_ERROR);
    }
    else
    {
        return (SD_BUSY);
    }
}

void SD_GetBaseInfo(SD_BaseInfo *info)
{
    info->CardType      = SDCard.CardType;
    info->CardVersion   = SDCard.CardVersion;
    info->BlockNbr      = SDCard.LogBlockNbr;
    info->BlockSize     = SDCard.LogBlockSize;
}


/* SD Card read blocks */
uint8_t SD_ReadMultipleBlocks(uint8_t *pBuff, uint32_t BlockAddr, uint32_t BlockNbr)
{
    uint32_t errorstate;
    uint16_t timeout = 0xFFFF;
    uint8_t result = 0;

#if (SDCARD_DMA_MODE)
    /* SD Transfer DMA Mode
    */
    errorstate = sd_ReadBlocks_DMA(pBuff, BlockAddr, BlockNbr);
    printf("sd_ReadBlocks_DMA, errorstate = 0x%08x\r\n", errorstate);
    if(errorstate == HAL_SD_ERROR_NONE)
    {
        while(timeout--)
        {
            DelayMs(5);
            if(SDReadCompleted)
            {
                /* check SD Card state */
                errorstate = (uint32_t)SD_GetCardState();
                if(errorstate == SD_READY)
                {
                    result = 1; 
                    break;
                }
            }
        
            if(SDReadWriteError == TRUE)
            {   
                result = 0;
                break;
            }
        }
        /* SDMMC stop transfer */
        SDCardIO_TRANSFER_DISABLE();
        /* Clear all the static flags */
        SDCardIO_CLEAR_FLAG(SDMMC_STATIC_FLAGS); 
        /* SDCARD stop transfer */
        if((SDCardContext & SD_CONTEXT_READ_MULTIPLE_BLOCK) != RESET)
        {
            SDMMC_CmdStopTransfer(SDCardIO);
        }
    }
#else
    /* SD Transfer Polling Mode
    */
    errorstate = sd_ReadBlocks(pBuff, BlockAddr, BlockNbr);
	printf("sd_ReadBlocks, errorstate = 0x%08x\r\n", errorstate);
    if(errorstate == HAL_SD_ERROR_NONE)
    {
        while(timeout--)
        {
            DelayMs(2);
            /* check SD Card state */
            errorstate = (uint32_t)SD_GetCardState();
            if(errorstate == SD_READY)
            {
                result = 1;
                break;
            }
        }
    }    
#endif    
    return result;
}

/* SD Card write blocks */
uint8_t SD_WriteMultipleBlocks(uint8_t *pData, uint32_t BlockAddr, uint32_t BlockNbr)
{
    uint32_t errorstate;
    uint16_t timeout = 0xFFFF;
    uint8_t result = 0;
#if (SDCARD_DMA_MODE)
    errorstate = sd_WriteBlocks_DMA(pData, BlockAddr, BlockNbr);
    printf("sd_WriteBlocks_DMA, errorstate = 0x%08x\r\n", errorstate);
    if(errorstate == HAL_SD_ERROR_NONE)
    {
        while(timeout--)
        {
            DelayMs(5);
            if(SDWriteCompleted)
            {
                /* check SD Card state */
                errorstate = (uint32_t)SD_GetCardState();
                if(errorstate == SD_READY)
                {
                    result = 1; 
                    break;
                }
            }

            if(SDReadWriteError == TRUE)
            {   
                result = 0;
                break;
            }
        }

        /* SDMMC stop transfer */
        SDCardIO_TRANSFER_DISABLE();
        /* Clear all the static flags */
        SDCardIO_CLEAR_FLAG(SDMMC_STATIC_FLAGS); 
        /* SDCARD stop transfer */
        if((SDCardContext & SD_CONTEXT_WRITE_MULTIPLE_BLOCK) != RESET)
        {
            SDMMC_CmdStopTransfer(SDCardIO);
        }
    }
#else
    errorstate = sd_WriteBlocks(pData, BlockAddr, BlockNbr);
	printf("sd_WriteBlocks, errorstate = 0x%08x\r\n", errorstate);
    if(errorstate == HAL_SD_ERROR_NONE)
    {
        while(timeout--)
        {
            DelayMs(2);
            /* check SD Card state */
            errorstate = (uint32_t)SD_GetCardState();
            if(errorstate == SD_READY)
            {
                result = 1;
                break;
            }
        }
    }
#endif
    return result;
}

void SD_Test(void)
{
	uint8_t sta;

	uint8_t tmp[512];
	uint16_t i;

    printf("SD Card test start...\r\n");
	printf("sdcard->type = %d\r\n", SDCard.CardType);
	printf("sdcard->version = %d\r\n", SDCard.CardVersion);
	printf("sdcard->speed = %d\r\n", SDCard.CardSpeed);
	printf("sdcard->class = %d\r\n", SDCard.Class);
	printf("sdcard->blocknbr = %d\r\n", SDCard.LogBlockNbr);
	printf("sdcard->blocksize = %d\r\n", SDCard.LogBlockSize);

	for(i = 0; i < 512; i++)
	{
		tmp[i] = i;
	}
	sta = SD_WriteMultipleBlocks(tmp, 1, 1);
	printf("sdcard write return = %d\r\n", sta);
	
	for(i = 0; i < 512; i++)
	{
		tmp[i] = 0;
	}
	sta = SD_ReadMultipleBlocks(tmp, 1, 1);
	printf("sdcard read return = %d\r\n", sta);

	for(i = 0; i < 512; i++)
	{
		printf("%d, ", tmp[i]);
	}
	printf("\r\n");
	printf("SD_Test done\r\n");
}

/****************** PRIVATE FUNCTION **********************/
static uint32_t sd_InitProcess(void)
{
    uint32_t errorstate = HAL_SD_ERROR_NONE;
    SD_InitTypeDef Init;
  
    /* Default SDMMC peripheral configuration for SD card initialization */
    Init.ClockEdge           = SDMMC_CLOCK_EDGE_RISING;
    Init.ClockPowerSave      = SDMMC_CLOCK_POWER_SAVE_DISABLE;
    Init.BusWide             = SDMMC_BUS_WIDE_1B;
    Init.HardwareFlowControl = SDMMC_HARDWARE_FLOW_CONTROL_DISABLE;
    Init.ClockDiv            = SDMMC_INIT_CLK_DIV;
    
    /* Initialize SDMMC peripheral interface with default configuration */
    SDMMC_Init(SDCardIO, Init);
  
