nusschAngE/stm32h7xx/Hardware/sdcard/sdcard.c
    /* Set Power State to ON */
    SDMMC_PowerState_ON(SDCardIO);

    /* Identify card operating voltage */
    errorstate = sd_PowerON();
    if(errorstate != HAL_SD_ERROR_NONE)
    {
        SDCardStatus = HAL_SD_STATE_READY;
        SDCardErrStatus = errorstate;
        printf("sd power on error\r\n");
        return errorstate;
    }

    /* Card initialization */
    errorstate = sd_InitCard();
    if(errorstate != HAL_SD_ERROR_NONE)
    {
        SDCardStatus = HAL_SD_STATE_READY;
        SDCardErrStatus = errorstate;
        printf("sd card init error\r\n");
        return errorstate;
    }

    return (HAL_SD_ERROR_NONE);    
}

static uint32_t sd_PowerON(void)
{
    __IO uint32_t count = 0;
    uint32_t response = 0, validvoltage = 0;
    uint32_t errorstate = HAL_SD_ERROR_NONE;
  
    /* CMD0: GO_IDLE_STATE */
    errorstate = SDMMC_CmdGoIdleState(SDCardIO);
    if(errorstate != HAL_SD_ERROR_NONE)
    {
        return errorstate;
    }
  
    /* CMD8: SEND_IF_COND: Command available only on V2.0 cards */
    errorstate = SDMMC_CmdOperCond(SDCardIO);
    if(errorstate != HAL_SD_ERROR_NONE)
    {
        //hsd->SdCard.CardVersion = CARD_V1_X;
        return HAL_SD_ERROR_UNSUPPORTED_FEATURE;
    }
    else
    {
        SDCard.CardVersion = CARD_V2_X;
    }

    /* SEND CMD55 APP_CMD with RCA as 0 */
    errorstate = SDMMC_CmdAppCommand(SDCardIO, 0);
    if(errorstate != HAL_SD_ERROR_NONE)
    {
        return HAL_SD_ERROR_UNSUPPORTED_FEATURE;
    }
    else
    {
        /* SD CARD */
        /* Send ACMD41 SD_APP_OP_COND with Argument 0x80100000 */
        while((!validvoltage) && (count < SDMMC_MAX_VOLT_TRIAL))
        {
            /* SEND CMD55 APP_CMD with RCA as 0 */
            errorstate = SDMMC_CmdAppCommand(SDCardIO, 0);
            if(errorstate != HAL_SD_ERROR_NONE)
            {
                return errorstate;
            }
      
            /* Send CMD41 */
            errorstate = SDMMC_CmdAppOperCommand(SDCardIO, SDMMC_VOLTAGE_WINDOW_SD | SDMMC_HIGH_CAPACITY | SD_SWITCH_1_8V_CAPACITY);
            if(errorstate != HAL_SD_ERROR_NONE)
            {
                return HAL_SD_ERROR_UNSUPPORTED_FEATURE;
            }

            /* Get command response */
            response = SDMMC_GetResponse(SDCardIO, SDMMC_RESP1);

            /* Get operating voltage*/
            validvoltage = (((response >> 31) == 1) ? 1 : 0);

            count++;
        }

        if(count >= SDMMC_MAX_VOLT_TRIAL)
        {
            return HAL_SD_ERROR_INVALID_VOLTRANGE;
        }
    
        if((response & SDMMC_HIGH_CAPACITY) == SDMMC_HIGH_CAPACITY) /* (response &= SD_HIGH_CAPACITY) */
        {
            SDCard.CardType = CARD_SDHC_SDXC;
        }
        else
        {
            return HAL_SD_ERROR_UNSUPPORTED_FEATURE;
        }
    }

    return HAL_SD_ERROR_NONE;
}


static uint32_t sd_PowerOFF(void)
{
    return HAL_SD_ERROR_NONE;
}

static uint32_t sd_Reset(void)
{
    return HAL_SD_ERROR_NONE;
}

static uint32_t sd_GetCardCSD(HAL_SD_CardCSDTypedef *pCSD)
{
  uint32_t tmp = 0;
  
  /* Byte 0 */
  tmp = (SDCSD[0] & 0xFF000000U) >> 24;
  pCSD->CSDStruct      = (uint8_t)((tmp & 0xC0) >> 6);
  pCSD->SysSpecVersion = (uint8_t)((tmp & 0x3C) >> 2);
  pCSD->Reserved1      = tmp & 0x03;
  
  /* Byte 1 */
  tmp = (SDCSD[0] & 0x00FF0000) >> 16;
  pCSD->TAAC = (uint8_t)tmp;
  
  /* Byte 2 */
  tmp = (SDCSD[0] & 0x0000FF00) >> 8;
  pCSD->NSAC = (uint8_t)tmp;
  
  /* Byte 3 */
  tmp = SDCSD[0] & 0x000000FF;
  pCSD->MaxBusClkFrec = (uint8_t)tmp;
  
  /* Byte 4 */
  tmp = (SDCSD[1] & 0xFF000000U) >> 24;
  pCSD->CardComdClasses = (uint16_t)(tmp << 4);
  
  /* Byte 5 */
  tmp = (SDCSD[1] & 0x00FF0000U) >> 16;
  pCSD->CardComdClasses |= (uint16_t)((tmp & 0xF0) >> 4);
  pCSD->RdBlockLen       = (uint8_t)(tmp & 0x0F);
  
  /* Byte 6 */
  tmp = (SDCSD[1] & 0x0000FF00U) >> 8;
  pCSD->PartBlockRead   = (uint8_t)((tmp & 0x80) >> 7);
  pCSD->WrBlockMisalign = (uint8_t)((tmp & 0x40) >> 6);
  pCSD->RdBlockMisalign = (uint8_t)((tmp & 0x20) >> 5);
  pCSD->DSRImpl         = (uint8_t)((tmp & 0x10) >> 4);
  pCSD->Reserved2       = 0; /*!< Reserved */
        
  if(SDCard.CardType == CARD_SDSC)
  {
    pCSD->DeviceSize = (tmp & 0x03) << 10;
    
    /* Byte 7 */
    tmp = (uint8_t)(SDCSD[1] & 0x000000FFU);
    pCSD->DeviceSize |= (tmp) << 2;
    
    /* Byte 8 */
    tmp = (uint8_t)((SDCSD[2] & 0xFF000000U) >> 24);
    pCSD->DeviceSize |= (tmp & 0xC0) >> 6;
    
    pCSD->MaxRdCurrentVDDMin = (tmp & 0x38) >> 3;
    pCSD->MaxRdCurrentVDDMax = (tmp & 0x07);
    
    /* Byte 9 */
    tmp = (uint8_t)((SDCSD[2] & 0x00FF0000U) >> 16);
    pCSD->MaxWrCurrentVDDMin = (tmp & 0xE0) >> 5;
    pCSD->MaxWrCurrentVDDMax = (tmp & 0x1C) >> 2;
    pCSD->DeviceSizeMul      = (tmp & 0x03) << 1;
    /* Byte 10 */
    tmp = (uint8_t)((SDCSD[2] & 0x0000FF00U) >> 8);
    pCSD->DeviceSizeMul |= (tmp & 0x80) >> 7;
    
    SDCard.BlockNbr  = (pCSD->DeviceSize + 1) ;
    SDCard.BlockNbr *= (1 << (pCSD->DeviceSizeMul + 2));
    SDCard.BlockSize = 1 << (pCSD->RdBlockLen);

    SDCard.LogBlockNbr =  (SDCard.BlockNbr) * ((SDCard.BlockSize) / 512); 
    SDCard.LogBlockSize = 512;
  }
  else if(SDCard.CardType == CARD_SDHC_SDXC)
  {
    /* Byte 7 */
    tmp = (uint8_t)(SDCSD[1] & 0x000000FFU);
    pCSD->DeviceSize = (tmp & 0x3F) << 16;
    
    /* Byte 8 */
    tmp = (uint8_t)((SDCSD[2] & 0xFF000000U) >> 24);
    
    pCSD->DeviceSize |= (tmp << 8);
    
    /* Byte 9 */
    tmp = (uint8_t)((SDCSD[2] & 0x00FF0000U) >> 16);
    
    pCSD->DeviceSize |= (tmp);
    
    /* Byte 10 */
    tmp = (uint8_t)((SDCSD[2] & 0x0000FF00U) >> 8);
    
    SDCard.LogBlockNbr = SDCard.BlockNbr = (((uint64_t)pCSD->DeviceSize + 1) * 1024);
    SDCard.LogBlockSize = SDCard.BlockSize = 512;
  }
  else
  {
    /* Clear all the static flags */
    SDCardIO_CLEAR_FLAG(SDMMC_STATIC_FLAGS);
    SDCardErrStatus |= HAL_SD_ERROR_UNSUPPORTED_FEATURE;
    SDCardStatus = HAL_SD_STATE_READY;
    return HAL_ERROR;
  }
  
  pCSD->EraseGrSize = (tmp & 0x40) >> 6;
  pCSD->EraseGrMul  = (tmp & 0x3F) << 1;
  
  /* Byte 11 */
  tmp = (uint8_t)(SDCSD[2] & 0x000000FF);
  pCSD->EraseGrMul     |= (tmp & 0x80) >> 7;
  pCSD->WrProtectGrSize = (tmp & 0x7F);
  
