nusschAngE/stm32h7xx/Hardware/sdcard/sdcard.c
  /* Byte 12 */
  tmp = (uint8_t)((SDCSD[3] & 0xFF000000U) >> 24);
  pCSD->WrProtectGrEnable = (tmp & 0x80) >> 7;
  pCSD->ManDeflECC        = (tmp & 0x60) >> 5;
  pCSD->WrSpeedFact       = (tmp & 0x1C) >> 2;
  pCSD->MaxWrBlockLen     = (tmp & 0x03) << 2;
  
  /* Byte 13 */
  tmp = (uint8_t)((SDCSD[3] & 0x00FF0000) >> 16);
  pCSD->MaxWrBlockLen      |= (tmp & 0xC0) >> 6;
  pCSD->WriteBlockPaPartial = (tmp & 0x20) >> 5;
  pCSD->Reserved3           = 0;
  pCSD->ContentProtectAppli = (tmp & 0x01);
  
  /* Byte 14 */
  tmp = (uint8_t)((SDCSD[3] & 0x0000FF00) >> 8);
  pCSD->FileFormatGrouop = (tmp & 0x80) >> 7;
  pCSD->CopyFlag         = (tmp & 0x40) >> 6;
  pCSD->PermWrProtect    = (tmp & 0x20) >> 5;
  pCSD->TempWrProtect    = (tmp & 0x10) >> 4;
  pCSD->FileFormat       = (tmp & 0x0C) >> 2;
  pCSD->ECC              = (tmp & 0x03);
  
  /* Byte 15 */
  tmp = (uint8_t)(SDCSD[3] & 0x000000FF);
  pCSD->CSD_CRC   = (tmp & 0xFE) >> 1;
  pCSD->Reserved4 = 1;
 
  return HAL_OK;
}


static uint32_t sd_InitCard(void)
{
    HAL_SD_CardCSDTypedef CSD;
    uint32_t errorstate = HAL_SD_ERROR_NONE;
    uint16_t sd_rca = 1;
  
    /* Check the power State */
    if(SDMMC_GetPowerState(SDCardIO) == 0) 
    {
        /* Power off */
        return HAL_SD_ERROR_REQUEST_NOT_APPLICABLE;
    }
  
    if(SDCard.CardType != CARD_SECURED) 
    {
        /* Send CMD2 ALL_SEND_CID */
        errorstate = SDMMC_CmdSendCID(SDCardIO);
        if(errorstate != HAL_SD_ERROR_NONE)
        {
            return errorstate;
        }

        /* Get Card identification number data */
        SDCID[0] = SDMMC_GetResponse(SDCardIO, SDMMC_RESP1);
        SDCID[1] = SDMMC_GetResponse(SDCardIO, SDMMC_RESP2);
        SDCID[2] = SDMMC_GetResponse(SDCardIO, SDMMC_RESP3);
        SDCID[3] = SDMMC_GetResponse(SDCardIO, SDMMC_RESP4);
    }

    if(SDCard.CardType != CARD_SECURED) 
    {
        /* Send CMD3 SET_REL_ADDR with argument 0 */
        /* SD Card publishes its RCA. */
        errorstate = SDMMC_CmdSetRelAdd(SDCardIO, &sd_rca);
        if(errorstate != HAL_SD_ERROR_NONE)
        {
            return errorstate;
        }
    }
    
    if(SDCard.CardType != CARD_SECURED) 
    {
        /* Get the SD card RCA */
        SDCard.RelCardAdd = sd_rca;
  
        /* Send CMD9 SEND_CSD with argument as card's RCA */
        errorstate = SDMMC_CmdSendCSD(SDCardIO, (uint32_t)(SDCard.RelCardAdd << 16U));
        if(errorstate != HAL_SD_ERROR_NONE)     
        {
            return errorstate;
        }
        else
        {
            /* Get Card Specific Data */
            SDCSD[0U] = SDMMC_GetResponse(SDCardIO, SDMMC_RESP1);
            SDCSD[1U] = SDMMC_GetResponse(SDCardIO, SDMMC_RESP2);
            SDCSD[2U] = SDMMC_GetResponse(SDCardIO, SDMMC_RESP3);
            SDCSD[3U] = SDMMC_GetResponse(SDCardIO, SDMMC_RESP4);
        }
    }
  
    /* Get the Card Class */
    SDCard.Class = (SDMMC_GetResponse(SDCardIO, SDMMC_RESP2) >> 20);
  
    /* Get CSD parameters */
    sd_GetCardCSD(&CSD);

    /* Select the Card */
    errorstate = SDMMC_CmdSelDesel(SDCardIO, (uint32_t)(((uint32_t)SDCard.RelCardAdd) << 16));
    if(errorstate != HAL_SD_ERROR_NONE)
    {
        return errorstate;
    }
  
    /* All cards are initialized */
    return HAL_SD_ERROR_NONE;
}

static uint32_t sd_EnableWideBus(void)
{
    SDMMC_InitTypeDef Init;
    uint32_t errorstate = HAL_SD_ERROR_NONE;
    
    if((SDMMC_GetResponse(SDCardIO, SDMMC_RESP1) & SDMMC_CARD_LOCKED) == SDMMC_CARD_LOCKED)
    {
        return HAL_SD_ERROR_LOCK_UNLOCK_FAILED;
    }   

    /* Send CMD55 APP_CMD with argument as card's RCA.*/
    errorstate = SDMMC_CmdAppCommand(SDCardIO, (uint32_t)(SDCard.RelCardAdd << 16));
    if(errorstate != HAL_OK)
    {
        return errorstate;
    }
  
    /* Send ACMD6 APP_CMD with argument as 2 for wide bus mode */
    errorstate = SDMMC_CmdBusWidth(SDCardIO, 2);
    if(errorstate != HAL_OK)
    {
        return errorstate;
    }

    /* Configure the SDMMC peripheral */
    Init.ClockEdge           = SDMMC_CLOCK_EDGE_RISING;
    Init.ClockPowerSave      = SDMMC_CLOCK_POWER_SAVE_DISABLE;
    Init.BusWide             = SDMMC_BUS_WIDE_4B;
    Init.HardwareFlowControl = SDMMC_HARDWARE_FLOW_CONTROL_DISABLE;
    Init.ClockDiv            = SDMMC_NSpeed_CLK_DIV;//input 200mhz, need 25mhz
    SDMMC_Init(SDCardIO, Init);

    return (HAL_SD_ERROR_NONE);
}

static uint32_t sd_DisableWideBus(void)
{
    SDMMC_InitTypeDef Init;
    uint32_t errorstate = HAL_SD_ERROR_NONE;
  
    if((SDMMC_GetResponse(SDCardIO, SDMMC_RESP1) & SDMMC_CARD_LOCKED) == SDMMC_CARD_LOCKED)
    {
        return HAL_SD_ERROR_LOCK_UNLOCK_FAILED;
    }

    /* Send CMD55 APP_CMD with argument as card's RCA */
    errorstate = SDMMC_CmdAppCommand(SDCardIO, (uint32_t)(SDCard.RelCardAdd << 16));
    if(errorstate != HAL_OK)
    {
        return errorstate;
    }
  
    /* Send ACMD6 APP_CMD with argument as 0 for single bus mode */
    errorstate = SDMMC_CmdBusWidth(SDCardIO, 0);
    if(errorstate != HAL_OK)
    {
        return errorstate;
    }

    /* Configure the SDMMC peripheral */
    Init.ClockEdge           = SDMMC_CLOCK_EDGE_RISING;
    Init.ClockPowerSave      = SDMMC_CLOCK_POWER_SAVE_DISABLE;
    Init.BusWide             = SDMMC_BUS_WIDE_1B;
    Init.HardwareFlowControl = SDMMC_HARDWARE_FLOW_CONTROL_DISABLE;
    Init.ClockDiv            = SDMMC_NSpeed_CLK_DIV;//input 200mhz, need 25mhz
    SDMMC_Init(SDCardIO, Init);

    return (HAL_SD_ERROR_NONE);
}

static uint32_t sd_SendStatus(uint32_t *pCardStatus)
{
  uint32_t errorstate = HAL_SD_ERROR_NONE;
  
  if(pCardStatus == NULL)
  {
    return HAL_SD_ERROR_PARAM;
  }
  
  /* Send Status command */
  errorstate = SDMMC_CmdSendStatus(SDCardIO, (uint32_t)(SDCard.RelCardAdd << 16));
  if(errorstate != HAL_OK)
  {
    return errorstate;
  }
  
  /* Get SD card status */
  *pCardStatus = SDMMC_GetResponse(SDCardIO, SDMMC_RESP1);
  
  return HAL_SD_ERROR_NONE;
}


static uint32_t sd_ReadBlocks(uint8_t *pData, uint32_t BlockAdd, uint32_t NumberOfBlocks)
{
    SDMMC_DataInitTypeDef config;
    uint32_t errorstate = HAL_SD_ERROR_NONE;
    uint32_t count = 0, timeout = 0xffff; 
    uint32_t *tempbuff = (uint32_t *)pData;
  
    if(NULL == pData)
    {
        SDCardErrStatus = HAL_SD_ERROR_PARAM;
        return (SDCardErrStatus);
    }
 
    if(SDCardStatus == HAL_SD_STATE_READY)
    {
        SDCardErrStatus = HAL_SD_ERROR_NONE;
    
