nusschAngE/stm32h7xx/Hardware/sdcard/sdcard.c
        if((BlockAdd + NumberOfBlocks) > (SDCard.LogBlockNbr))
        {
            SDCardErrStatus = HAL_SD_ERROR_ADDR_OUT_OF_RANGE;
            return (SDCardErrStatus);
        }

        /* check current card state */
        if(SD_GetCardState() != SD_READY)
        {
            SDCardErrStatus = HAL_SD_ERROR_BUSY;
            return (SDCardErrStatus);
        }
    
        SDCardStatus = HAL_SD_STATE_BUSY;
    
        /* Initialize data control register */
        SDCardIO->DCTRL = 0;
    
        if(SDCard.CardType != CARD_SDHC_SDXC)
        {
            BlockAdd *= 512;
        }
      
        /* Set Block Size for Card */
        errorstate = SDMMC_CmdBlockLength(SDCardIO, BLOCKSIZE);
        if(errorstate != HAL_SD_ERROR_NONE)
        {
            /* Clear all the static flags */
            SDCardIO_CLEAR_FLAG(SDMMC_STATIC_FLAGS);
            SDCardErrStatus = errorstate;
            SDCardStatus = HAL_SD_STATE_READY;
            return (SDCardErrStatus);
        }
    
        /* Read block(s) in polling mode */
        if(NumberOfBlocks > 1)
        {
            SDCardContext = SD_CONTEXT_READ_MULTIPLE_BLOCK;
      
            /* Read Multi Block command */ 
            errorstate = SDMMC_CmdReadMultiBlock(SDCardIO, BlockAdd);
        }
        else
        {
            SDCardContext = SD_CONTEXT_READ_SINGLE_BLOCK;
      
            /* Read Single Block command */
            errorstate = SDMMC_CmdReadSingleBlock(SDCardIO, BlockAdd);
        }
        /* cmd error state */
        if(errorstate != HAL_SD_ERROR_NONE)
        {
            /* Clear all the static flags */
            SDCardIO_CLEAR_FLAG(SDMMC_STATIC_FLAGS);
            SDCardErrStatus = errorstate;
            SDCardStatus = HAL_SD_STATE_READY;
            return (SDCardErrStatus);
        }

        /* Configure the SD DPSM (Data Path State Machine) */
        config.DataTimeOut   = SDMMC_DATATIMEOUT;
        config.DataLength    = NumberOfBlocks * BLOCKSIZE;
        config.DataBlockSize = SDMMC_DATABLOCK_SIZE_512B;
        config.TransferDir   = SDMMC_TRANSFER_DIR_TO_SDMMC;
        config.TransferMode  = SDMMC_TRANSFER_MODE_BLOCK;
        config.DPSM          = SDMMC_DPSM_ENABLE;
        SDMMC_ConfigData(SDCardIO, &config);
        /* reading state */
        //SDCardIO_TRANSFER_ENABLE();
        SDCardStatus = HAL_SD_STATE_RECEIVING;
        /* Poll on SDMMC flags */
        while(!SDCardIO_GET_FLAG(SDMMC_FLAG_RXOVERR | SDMMC_FLAG_DCRCFAIL | SDMMC_FLAG_DTIMEOUT | SDMMC_FLAG_DATAEND))
        {
            if (SDCardIO_GET_FLAG(SDMMC_FLAG_RXFIFOHF))
            {
                /* Read data from SDMMC Rx FIFO */
                for(count = 0U; count < 8U; count++)
                {
                    *(tempbuff + count) = SDMMC_ReadFIFO(SDCardIO);
                }
                tempbuff += 8U;
                timeout = 0xffff;
            }
            //DelayUs(50);
            if((timeout == 0) || (--timeout == 0))
            {
                /* Clear all the static flags */
                SDCardIO_CLEAR_FLAG(SDMMC_STATIC_FLAGS);
                SDCardErrStatus = HAL_SD_ERROR_TIMEOUT;
                SDCardStatus = HAL_SD_STATE_READY;
                return (SDCardErrStatus);
            }
        }
    
        /* Send stop transmission command in case of multiblock read */
        if(SDCardIO_GET_FLAG(SDMMC_FLAG_DATAEND) && (NumberOfBlocks > 1U))
        {    
            if(SDCard.CardType != CARD_SECURED)
            {
                /* Send stop transmission command */
                errorstate = SDMMC_CmdStopTransfer(SDCardIO);
                if(errorstate != HAL_SD_ERROR_NONE)
                {
                    /* Clear all the static flags */
                    SDCardIO_CLEAR_FLAG(SDMMC_STATIC_FLAGS);
                    SDCardErrStatus = errorstate;
                    SDCardStatus = HAL_SD_STATE_READY;
                    return (SDCardErrStatus);
                }
            }
        }
    
        /* Get error state */
        if (SDCardIO_GET_FLAG(SDMMC_FLAG_DTIMEOUT))
        {
            /* Clear all the static flags */
            SDCardIO_CLEAR_FLAG(SDMMC_STATIC_FLAGS);
            SDCardErrStatus = HAL_SD_ERROR_DATA_TIMEOUT;
            SDCardStatus = HAL_SD_STATE_READY;
            return (SDCardErrStatus);
        }
        else if (SDCardIO_GET_FLAG(SDMMC_FLAG_DCRCFAIL))
        {
            /* Clear all the static flags */
            SDCardIO_CLEAR_FLAG(SDMMC_STATIC_FLAGS);
            SDCardErrStatus = HAL_SD_ERROR_DATA_CRC_FAIL;
            SDCardStatus = HAL_SD_STATE_READY;
            return (SDCardErrStatus);
        }
        else if (SDCardIO_GET_FLAG(SDMMC_FLAG_RXOVERR))
        {
            /* Clear all the static flags */
            SDCardIO_CLEAR_FLAG(SDMMC_STATIC_FLAGS);
            SDCardErrStatus = HAL_SD_ERROR_RX_OVERRUN;
            SDCardStatus = HAL_SD_STATE_READY;
            return (SDCardErrStatus);
        }
    
        /* Clear all the static flags */
        SDCardIO_CLEAR_FLAG(SDMMC_STATIC_FLAGS);
        SDCardStatus = HAL_SD_STATE_READY;
    
        return (HAL_SD_ERROR_NONE);
    }
    else
    {
        SDCardErrStatus = HAL_SD_ERROR_BUSY;
        return (SDCardErrStatus);
    }
}

static uint32_t sd_WriteBlocks(uint8_t *pData, uint32_t BlockAdd, uint32_t NumberOfBlocks)
{
    SDMMC_DataInitTypeDef config;
    uint32_t errorstate = HAL_SD_ERROR_NONE;
    uint32_t count = 0, timeout = 0xffff;
    uint32_t *tempbuff = (uint32_t *)pData;
  
    if(NULL == pData)
    {
        SDCardErrStatus = HAL_SD_ERROR_PARAM;
        return (SDCardErrStatus);
    }

    if(SDCardStatus == HAL_SD_STATE_READY)
    {
        SDCardErrStatus = HAL_SD_ERROR_NONE;
    
        if((BlockAdd + NumberOfBlocks) > (SDCard.LogBlockNbr))
        {
            SDCardErrStatus = HAL_SD_ERROR_ADDR_OUT_OF_RANGE;
            return (SDCardErrStatus);
        }

        /* check current card state */
        if(SD_GetCardState() != SD_READY)
        {
            SDCardErrStatus = HAL_SD_ERROR_BUSY;
            return (SDCardErrStatus);
        }
    
        SDCardStatus = HAL_SD_STATE_BUSY;
    
        /* Initialize data control register */
        SDCardIO->DCTRL = 0;
     
