nusschAngE/stm32h7xx/Hardware/sdcard/sdcard.c
        if(SDCard.CardType != CARD_SDHC_SDXC)
        {
            BlockAdd *= 512;
        }
    
        /* Set Block Size for Card */ 
        errorstate = SDMMC_CmdBlockLength(SDCardIO, BLOCKSIZE);
        if(errorstate != HAL_SD_ERROR_NONE)
        {
            /* Clear all the static flags */
            SDCardIO_CLEAR_FLAG(SDMMC_STATIC_FLAGS);  
            SDCardErrStatus = errorstate;
            SDCardStatus = HAL_SD_STATE_READY;
            return (SDCardErrStatus);
        }

		/* Configure the SD DPSM (Data Path State Machine) */
		config.DataTimeOut	 = SDMMC_DATATIMEOUT;
		config.DataLength	 = NumberOfBlocks * BLOCKSIZE;
		config.DataBlockSize = SDMMC_DATABLOCK_SIZE_512B;
		config.TransferDir	 = SDMMC_TRANSFER_DIR_TO_CARD;
		config.TransferMode  = SDMMC_TRANSFER_MODE_BLOCK;
		config.DPSM 		 = SDMMC_DPSM_ENABLE;
		SDMMC_ConfigData(SDCardIO, &config);

        /* Write Blocks in Polling mode */
		if(NumberOfBlocks > 1U)
		{
			SDCardContext = SD_CONTEXT_WRITE_MULTIPLE_BLOCK;
			  
			/* Write Multi Block command */ 
			errorstate = SDMMC_CmdWriteMultiBlock(SDCardIO, BlockAdd);
		}
		else
		{
			SDCardContext = SD_CONTEXT_WRITE_SINGLE_BLOCK;
			  
			/* Write Single Block command */
			errorstate = SDMMC_CmdWriteSingleBlock(SDCardIO, BlockAdd);
		}
		/* error state */
		if(errorstate != HAL_SD_ERROR_NONE)
		{
			/* Clear all the static flags */
			SDCardIO_CLEAR_FLAG(SDMMC_STATIC_FLAGS); 
			SDCardErrStatus = errorstate;
			SDCardStatus = HAL_SD_STATE_READY;
			return (SDCardErrStatus);
		}
        
        /* reading state */
        //SDCardIO_TRANSFER_ENABLE();
        SDCardStatus = HAL_SD_STATE_TRANSFER;
    
        /* Write block(s) in polling mode */
        while(!SDCardIO_GET_FLAG(SDMMC_FLAG_TXUNDERR | SDMMC_FLAG_DCRCFAIL | SDMMC_FLAG_DTIMEOUT | SDMMC_FLAG_DATAEND))
        {
            if (SDCardIO_GET_FLAG(SDMMC_FLAG_TXFIFOHE))
            {
                /* Write data to SDMMC Tx FIFO */
                for(count = 0U; count < 8U; count++)
                {
                    SDMMC_WriteFIFO(SDCardIO, (tempbuff + count));
                }
                tempbuff += 8U;
            }
            //DelayUs(50);
            if((timeout == 0)||(--timeout == 0))
            {
                /* Clear all the static flags */
                SDCardIO_CLEAR_FLAG(SDMMC_STATIC_FLAGS);  
                SDCardErrStatus = errorstate;
                SDCardStatus = HAL_SD_STATE_READY;
                printf("WriteBlocks timeout\r\n");
                return (SDCardErrStatus);
            }
        }
    
        /* Send stop transmission command in case of multiblock write */
        if(SDCardIO_GET_FLAG(SDMMC_FLAG_DATAEND) && (NumberOfBlocks > 1U))
        { 
            if(SDCard.CardType != CARD_SECURED)
            { 
                /* Send stop transmission command */
                errorstate = SDMMC_CmdStopTransfer(SDCardIO);
                if(errorstate != HAL_SD_ERROR_NONE)
                {
                    /* Clear all the static flags */
                    SDCardIO_CLEAR_FLAG(SDMMC_STATIC_FLAGS);  
                    SDCardErrStatus = errorstate;
                    SDCardStatus = HAL_SD_STATE_READY;
                    return (SDCardErrStatus);
                }
            }
        }
    
        /* Get error state */
        if (SDCardIO_GET_FLAG(SDMMC_FLAG_DTIMEOUT))
        {
            /* Clear all the static flags */
            SDCardIO_CLEAR_FLAG(SDMMC_STATIC_FLAGS);
            SDCardErrStatus = HAL_SD_ERROR_DATA_TIMEOUT;
            SDCardStatus = HAL_SD_STATE_READY;
            printf("WriteBlocks dtimeout\r\n");
            return (SDCardErrStatus);
        }
        else if (SDCardIO_GET_FLAG(SDMMC_FLAG_DCRCFAIL))
        {
            /* Clear all the static flags */
            SDCardIO_CLEAR_FLAG(SDMMC_STATIC_FLAGS);
            SDCardErrStatus = HAL_SD_ERROR_DATA_CRC_FAIL;
            SDCardStatus = HAL_SD_STATE_READY;
            printf("WriteBlocks dcrc fail\r\n");
            return (SDCardErrStatus);
        }
        else if (SDCardIO_GET_FLAG(SDMMC_FLAG_TXUNDERR))
        {
            /* Clear all the static flags */
            SDCardIO_CLEAR_FLAG(SDMMC_STATIC_FLAGS);
            SDCardErrStatus = HAL_SD_ERROR_TX_UNDERRUN;
            SDCardStatus = HAL_SD_STATE_READY;
            printf("WriteBlocks tx fifo under run\r\n");
            return (SDCardErrStatus);
        }
    
        /* Clear all the static flags */
        SDCardIO_CLEAR_FLAG(SDMMC_STATIC_FLAGS);
    
        SDCardStatus = HAL_SD_STATE_READY;
    
        return (HAL_SD_ERROR_NONE);
    }
    else
    {
        SDCardErrStatus = HAL_SD_ERROR_BUSY;
        return (SDCardErrStatus);
    }
}


#if (SDCARD_DMA_MODE)
static uint32_t sd_ReadBlocks_DMA(uint8_t *pData, uint32_t BlockAdd, uint32_t NumberOfBlocks)
{
    SDMMC_DataInitTypeDef config;
    uint32_t errorstate = HAL_SD_ERROR_NONE;

    if(NULL == pData)
    {
        SDCardErrStatus = HAL_SD_ERROR_PARAM;
        return (SDCardErrStatus);
    }
  
    if(SDCardStatus == HAL_SD_STATE_READY)
    {
        SDCardErrStatus = HAL_SD_ERROR_NONE;
    
        if((BlockAdd + NumberOfBlocks) > (SDCard.LogBlockNbr))
        {
            SDCardErrStatus = HAL_SD_ERROR_ADDR_OUT_OF_RANGE;
            return (SDCardErrStatus);
        }

        /* check current card state */
        if(SD_GetCardState() != SD_READY)
        {
            SDCardErrStatus = HAL_SD_ERROR_BUSY;
            return (SDCardErrStatus);
        }
    
        SDCardStatus = HAL_SD_STATE_BUSY;
    
        /* Initialize data control register */
        SDCardIO->DCTRL = 0U;
    
        pRxBuffPtr = (uint32_t*)pData;
        RxBuffSize = BLOCKSIZE * NumberOfBlocks;
        
        if(SDCard.CardType != CARD_SDHC_SDXC)
        {
            BlockAdd *= 512U;
        }

        /* Set Block Size for Card */ 
        errorstate = SDMMC_CmdBlockLength(SDCardIO, BLOCKSIZE);
        if(errorstate != HAL_SD_ERROR_NONE)
        {
            /* Clear all the static flags */
            SDCardIO_CLEAR_FLAG(SDMMC_STATIC_FLAGS); 
            SDCardErrStatus = errorstate;
            SDCardStatus = HAL_SD_STATE_READY;
            return (SDCardErrStatus);
        }

        /* Read Blocks in DMA mode */
        if(NumberOfBlocks > 1U)
        {
            SDCardContext = (SD_CONTEXT_READ_MULTIPLE_BLOCK | SD_CONTEXT_DMA);
      
            /* Read Multi Block command */
            errorstate = SDMMC_CmdReadMultiBlock(SDCardIO, BlockAdd);
        }
        else
        {
            SDCardContext = (SD_CONTEXT_READ_SINGLE_BLOCK | SD_CONTEXT_DMA);
      
            /* Read Single Block command */
            errorstate = SDMMC_CmdReadSingleBlock(SDCardIO, BlockAdd);
        }
        if(errorstate != HAL_SD_ERROR_NONE)
        {
            /* Clear all the static flags */
            SDCardIO_CLEAR_FLAG(SDMMC_STATIC_FLAGS);
            SDCardIO_DISABLE_IT(SDMMC_IT_DCRCFAIL | SDMMC_IT_DTIMEOUT | SDMMC_IT_RXOVERR \
                                | SDMMC_IT_DATAEND | SDMMC_IT_IDMATE);
            SDCardErrStatus = errorstate;
            SDCardStatus = HAL_SD_STATE_READY;
            return (SDCardErrStatus);
        }
    	/* Enable transfer interrupts */
        SDCardIO_ENABLE_IT(SDMMC_IT_DCRCFAIL | SDMMC_IT_DTIMEOUT | SDMMC_IT_RXOVERR \
                            | SDMMC_IT_DATAEND | SDMMC_IT_IDMATE);
        /* SDMMC DMA config */
        SDCardIO->IDMACTRL  = SDMMC_ENABLE_IDMA_SINGLE_BUFF; 
        SDCardIO->IDMABASE0 = (uint32_t) pData ;        
        
        /* Configure the SD DPSM (Data Path State Machine) */ 
        config.DataTimeOut   = SDMMC_DATATIMEOUT;
        config.DataLength    = BLOCKSIZE * NumberOfBlocks;
        config.DataBlockSize = SDMMC_DATABLOCK_SIZE_512B;
        config.TransferDir   = SDMMC_TRANSFER_DIR_TO_SDMMC;
        config.TransferMode  = SDMMC_TRANSFER_MODE_BLOCK;
        config.DPSM          = SDMMC_DPSM_ENABLE;
        SDMMC_ConfigData(SDCardIO, &config);
        /* transfer enable */
        //SDCardIO_TRANSFER_ENABLE();
        /* reading state */
        SDCardStatus = HAL_SD_STATE_RECEIVING;
        SDReadCompleted = FALSE;
        SDReadWriteError = FALSE;        
    
        return (HAL_SD_ERROR_NONE);
    }
    else
    {
        SDCardErrStatus = HAL_SD_ERROR_BUSY;
        return (SDCardErrStatus);
    }
}

static uint32_t sd_WriteBlocks_DMA(uint8_t *pData, uint32_t BlockAdd, uint32_t NumberOfBlocks)
{
    SDMMC_DataInitTypeDef config;
    uint32_t errorstate = HAL_SD_ERROR_NONE;
  
    if(NULL == pData)
    {
        SDCardErrStatus = HAL_SD_ERROR_PARAM;
        return (SDCardErrStatus);
    }

    if(SDCardStatus == HAL_SD_STATE_READY)
    {
        SDCardErrStatus = HAL_SD_ERROR_NONE;
    
