nusschAngE/stm32h7xx/Hardware/sdcard/sdcard.c
        if((BlockAdd + NumberOfBlocks) > (SDCard.LogBlockNbr))
        {
            SDCardErrStatus = HAL_SD_ERROR_ADDR_OUT_OF_RANGE;
            return (SDCardErrStatus);
        }

        /* check current card state */
        if(SD_GetCardState() != SD_READY)
        {
            SDCardErrStatus = HAL_SD_ERROR_BUSY;
            return (SDCardErrStatus);
        }
    
        SDCardStatus = HAL_SD_STATE_BUSY;
    
        /* Initialize data control register */
        SDCardIO->DCTRL = 0U;
    
        pTxBuffPtr = (uint32_t*)pData;
        TxBuffSize = BLOCKSIZE * NumberOfBlocks;

        if(SDCard.CardType != CARD_SDHC_SDXC)
        {
            BlockAdd *= 512U;
        }

        /* Set Block Size for Card */ 
        errorstate = SDMMC_CmdBlockLength(SDCardIO, BLOCKSIZE);
        if(errorstate != HAL_SD_ERROR_NONE)
        {
            /* Clear all the static flags */
            SDCardIO_CLEAR_FLAG(SDMMC_STATIC_FLAGS); 
            SDCardErrStatus = errorstate;
            SDCardStatus = HAL_SD_STATE_READY;
            return (SDCardErrStatus);
        }
        /* Write Blocks in Polling mode */
        if(NumberOfBlocks > 1U)
        {
            SDCardContext = (SD_CONTEXT_WRITE_MULTIPLE_BLOCK | SD_CONTEXT_DMA);
      
            /* Write Multi Block command */ 
            errorstate = SDMMC_CmdWriteMultiBlock(SDCardIO, BlockAdd);
        }
        else
        {
            SDCardContext = (SD_CONTEXT_WRITE_SINGLE_BLOCK | SD_CONTEXT_DMA);
      
            /* Write Single Block command */
            errorstate = SDMMC_CmdWriteSingleBlock(SDCardIO, BlockAdd);
        }
        if(errorstate != HAL_SD_ERROR_NONE)
        {
            /* Clear all the static flags */
            SDCardIO_CLEAR_FLAG(SDMMC_STATIC_FLAGS); 
            SDCardIO_DISABLE_IT(SDMMC_IT_DCRCFAIL | SDMMC_IT_DTIMEOUT | SDMMC_IT_TXUNDERR \
                                | SDMMC_IT_DATAEND | SDMMC_IT_IDMATE); 
            SDCardErrStatus |= errorstate;
            SDCardStatus = HAL_SD_STATE_READY;
            return (SDCardErrStatus);
        }

		/* Enable transfer interrupts */
		SDCardIO_ENABLE_IT(SDMMC_IT_DCRCFAIL | SDMMC_IT_DTIMEOUT | SDMMC_IT_TXUNDERR \
									| SDMMC_IT_DATAEND | SDMMC_IT_IDMATE); 
		/* SDMMC DMA config */
		SDCardIO->IDMACTRL	= SDMMC_ENABLE_IDMA_SINGLE_BUFF; 
		SDCardIO->IDMABASE0 = (uint32_t) pData ;
        
        /* Configure the SD DPSM (Data Path State Machine) */
        config.DataTimeOut   = SDMMC_DATATIMEOUT;
        config.DataLength    = BLOCKSIZE * NumberOfBlocks;
        config.DataBlockSize = SDMMC_DATABLOCK_SIZE_512B;
        config.TransferDir   = SDMMC_TRANSFER_DIR_TO_CARD;
        config.TransferMode  = SDMMC_TRANSFER_MODE_BLOCK;
        config.DPSM          = SDMMC_DPSM_ENABLE;
        SDMMC_ConfigData(SDCardIO, &config);
        /* Transfer enable */
		//SDCardIO_TRANSFER_ENABLE(); 
        /* reading state */
        SDCardStatus = HAL_SD_STATE_TRANSFER;
        SDWriteCompleted = FALSE;
        SDReadWriteError = FALSE;
               
  
        return (HAL_SD_ERROR_NONE);
    }
    else
    {
        SDCardStatus = HAL_SD_ERROR_BUSY;
        return (SDCardStatus);
    }
}

#endif

#if 0
static uint32_t sd_Read_IT(void)
{
  uint32_t count = 0;
  uint32_t* tmp;

  tmp = (uint32_t*)pRxBuffPtr;
  
  /* Read data from SDMMC Rx FIFO */
  for(count = 0; count < 8; count++)
  {
    *(tmp + count) = SDMMC_ReadFIFO(SDCardIO);
  }
  pRxBuffPtr += 8;
  
  return (HAL_SD_ERROR_NONE);
}

static uint32_t sd_Write_IT(void)
{
    uint32_t count = 0;
    uint32_t* tmp;
  
    tmp = (uint32_t*)pTxBuffPtr;
  
    /* Write data to SDMMC Tx FIFO */
    for(count = 0; count < 8; count++)
    {
        SDMMC_WriteFIFO(SDCardIO, (tmp + count));
    }
    pTxBuffPtr += 8;

    return (HAL_SD_ERROR_NONE);
}
#endif



